Incontineuation to the module 10 Combining Pandas Objects

#Concat function

This is the function that we recommend using if you have multiple data files with the same column names. It could be sales for a chain vendor where each year would be saved in a separate spreadsheet.

Let’s start with creating a data frame for sales for the year 2018:

In [2]:
import pandas as pd
import numpy as np
sales_dictionary_2018 = {'name': ['Michael', 'Ana'], 
                         'revenue': ['1000', '2000'], 
                         'number_of_itmes_sold': [5, 7]}
sales_df_2018 = pd.DataFrame(sales_dictionary_2018)
sales_df_2018.head()

      name revenue  number_of_itmes_sold
0  Michael    1000                     5
1      Ana    2000                     7

Let’s create now a data frame that has exactly the same columns but covers a new time period: the year 2019.

In [4]:
sales_dictionary_2019 = {'name': ['Michael', 'Ana', 'George'], 
                     'revenue': ['1000', '3000', '2000'], 
                     'number_of_itmes_sold': [5, 8, 7]}
sales_df_2019 = pd.DataFrame(sales_dictionary_2019)
sales_df_2019.head()

      name revenue  number_of_itmes_sold
0  Michael    1000                     5
1      Ana    3000                     8
2   George    2000                     7

You can see that in 2019 we had a new rep George except for Michael and Ana from 2018 sales. Otherwise, the data structure is the same as we had for the 2018 year.

So how can you combine these two data frames together in order to have them in one data frame? You can use contact() function:

https://towardsdatascience.com/practical-uses-of-merge-join-and-concat-8f011bbac241

for joins
https://medium.com/code-python/how-to-join-dataframes-in-pandas-in-python-fa4f41214517

In [5]:
pd.concat([sales_df_2018, sales_df_2019], ignore_index=True)

      name revenue  number_of_itmes_sold
0  Michael    1000                     5
1      Ana    2000                     7
2  Michael    1000                     5
3      Ana    3000                     8
4   George    2000                     7

You can see that after this operation all our data is now on one data frame!

Concat() function takes a list of data frames and adds all their rows together resulting in one data frame. We set here ignore_index=True as otherwise, the resulting data frame would have indexes taken from the original data frame. In our case, we do not want that. Note that you can pass as many data frames as you want in a list form.

#Merge function

We are going to start by learning about merge() function as this is probably the most common way of adding new columns to the data frame based on some common conditions.
In order to illustrate the usage of merge() we will go back to our store example which had a data frame from sales for 2018 and 2019.

Imagine that you had another file that was containing personal data for each of the reps. Now, you would like to add this data to sales data frames.

Let’s start by creating a data frame for personal rep info.

In [6]:
rep_info_dictionary = {'name': ['Ana', 'Michael', 'George'], 
                     'location': ['New York', 'San Jose', 'New York']}
rep_info_df = pd.DataFrame(rep_info_dictionary)
rep_info_df.head()

      name  location
0      Ana  New York
1  Michael  San Jose
2   George  New York

As you can see there are only two columns: name and location. The name is something that was also present in our yearly sales data. Imagine that you would like to add the location of the rep to your 2019 data.

You could merge the rep_info_df to sales_df_2019 using ‘name’ as the column that links both of these data frames:

In [7]:
sales_df_2019.merge(rep_info_df, on='name')

      name revenue  number_of_itmes_sold  location
0  Michael    1000                     5  San Jose
1      Ana    3000                     8  New York
2   George    2000                     7  New York

You can see that our original data frame with sales data for 2019 has now another column, location. It is a result of merging rp_info_df and sales_df_2019.

As default pandas merge uses ‘inner join’ to perform merge operation. We are not going to discuss types of joins here but if you are familiar with SQL joins they work exactly the same.

If concepts of inner, left, right and outer joins are not familiar to you I suggest that you find some articles that explain these SQL concepts. Once you understand the SQL joins you will be able to use them with pandas merge() function as they work exactly the same.

#join()

This is a special case of merge when at least one of the columns that you are joining on is an index. Let’s modify our 2019 data to have names as indexes:

In [8]:
sales_df_2019.set_index('name', inplace=True)
sales_df_2019.head()

        revenue  number_of_itmes_sold
name
Michael    1000                     5
Ana        3000                     8
George     2000                     7

As you can see name is not a column but index of the data frame after we have used set_index() function on it.

Let’s now do the same to rep info data frame:

In [9]:
rep_info_df.set_index('name', inplace=True)
rep_info_df.head()

         location
name
Ana      New York
Michael  San Jose
George   New York

Now both rep_info_df and sales_df_2019 have names as indexes. Now I can use join() instead of merge() in order to combine the data in the same way as we did with merge() in the previous section.

In [10]:
sales_df_2019.join(rep_info_df)

        revenue  number_of_itmes_sold  location
name
Michael    1000                     5  San Jose
Ana        3000                     8  New York
George     2000                     7  New York

As you can see I do not have to specify the on parameter as it was the case with merge(). This is because join() function takes indexes of data frames as defaults to combine data from both tables.

Join() function similar to merge() can be modified to use different types of SQL join by specifying the how parameter. The default with join is a ‘left’ join and this is what we have used in our example.

#Summary

Let’s summarize our findings.

We have used concat() when we were trying to add multiple data blocks with the same structure and put them in one data frame one below the other.

In order to add column data to existing entries, we have used merge(). The data was added based on the same values for columns on which were merging data frames.

Join() was a special case of merge() when at least one of the entries we are joining on was the index.

I hope you have enjoyed this article and have learned how to use these basic data frame operations to combine data.

In [14]:
![picture](https://drive.google.com/uc?export=view&id=1O19anr7mK-q0wRrKqoXepHEygekUfIlz)

/bin/bash: -c: line 0: syntax error near unexpected token `https://drive.google.com/uc?export=view'
/bin/bash: -c: line 0: `[picture](https://drive.google.com/uc?export=view&id=1O19anr7mK-q0wRrKqoXepHEygekUfIlz)'